{"meta":{"title":"HelloWorld","subtitle":"","description":"","author":"HelloWorldZTR","url":"https://helloworldztr.github.io","root":"/"},"pages":[{"title":"404 Not Found","date":"2020-04-07T02:32:24.000Z","updated":"2020-04-07T02:32:24.953Z","comments":false,"path":"/404.html","permalink":"https://helloworldztr.github.io/404.html","excerpt":"","text":""},{"title":"About","date":"2020-04-04T13:34:33.000Z","updated":"2020-04-07T03:06:29.897Z","comments":true,"path":"about/index.html","permalink":"https://helloworldztr.github.io/about/index.html","excerpt":"","text":"IntroductionI am currently a student from China. I personally enjoy programming and PC building, etc. However, due to my schoolwork, I probably have little time to write this blog and have to translate some articles in Chinese. If I posted a blog that is translated from Chinese, I will paste a link at the top of the article. Something about this websiteAs I cannot get a license for the website ( I am a student QAQ ), this blog is hosted on Github now using GitPage. The blog theme is written by cofess, which you can see on the bottom left of the page. Great thanks to cofess. XD"},{"title":"Categories","date":"2020-04-07T01:25:48.175Z","updated":"2020-04-07T01:25:48.175Z","comments":false,"path":"categories/index.html","permalink":"https://helloworldztr.github.io/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2020-04-07T01:25:55.290Z","updated":"2020-04-07T01:25:55.290Z","comments":false,"path":"tags/index.html","permalink":"https://helloworldztr.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"All Black! Be quiet! PURE BASE 500 Build pt.1","slug":"All-Black-Be-quite","date":"2020-04-07T05:45:51.000Z","updated":"2020-04-07T08:09:05.124Z","comments":true,"path":"2020/04/07/All-Black-Be-quite/","link":"","permalink":"https://helloworldztr.github.io/2020/04/07/All-Black-Be-quite/","excerpt":"","text":"Translated from https://www.chiphell.com/thread-2192145-1-1.html.Only for learning.PS. It hard to translate all this article at the same time without mistake, so I split it into 3 parts. I’d also like to build something like this, I really love this style! ForewordI didn’t waste time though I was resting at home. So I helped build a system. After trying out builds with all kinds of lighting effects, a system with out lighting effects seems to be more out-standing. I used Ryzen 7 3700X + X570 + RTX 2080 platform. Considering that it has no lighting effects, I chose be quiet!‘s PURE BASE 500 for the case. It has a simple but elegant design and is pretty easy to install. For cooling, an air-cooling solution with out RGB was the best choice. It turned out to be extreamly quiet. And as for the power-supply, I used a HCG750 with 10 years waranty. Here are the basic requirements for this build: Powerful and can handle jobs for designing, video and photo editing and can provide a smooth experience playing PUBG or watching hi-res videos. Look simple and does need to have any lighting effects. Have good expandability and is easy to add additional memory and storage later. Build specs: Processor AMD Ryzen 7 3700X Motherboard Asus STRIX X570-E GAMING Memory Corsair dominator platinum DDR4 3200 16GB x 2 Graphics Card EVGA GeForce RTX 2080 FTW3 ULTRA GAMING SSD Storage Wd SN750 1TB Cooler be quiet! DARK ROCK PRO 4 Cooling Fan be quiet! SILENT WINGS 3 PWM 120mm x 4 Power-supply Antec HCG750 Gold Case be quiet! PURE BASE 500 (with glass panel) Build Show45° The front view of the case: it uses a round-cut design and has a quality brushed finish be quiet!‘s logo Front IO and button: 2 USB 3.0, start button and audio jack. Top View of the case: A dust filter and cooling holes at the back of the case. After removing the panel, you can see the top mounting holes for the fans. It also includes a magnetic dust filter which can stick to the top of the case to help improve cooling. The back of the case: A large filter at the bottom of the case: Can be pulled out for cleaning. On the left side of the case, there is a large piece of tempered glass. And on the right is steel.After removing the panel: 45° Main components. You can see it’s almost matt black and grey. The HUGE cooler: Memory: A little cover for cable management. It has a be quiet! logo on it. Graphics card:The 3 slot card is really bulky. You can see the THICK heat sink and heat pipe. RTX 2080: Jumpers on the mother board: There is plenty of holes at the top of the power-supply to provide cool air for the graphics card. Three 12cm fans in the front of the case to intake fresh air: The jumper cover where you can hide your pci-e power cord. The cool air will be directly sent to the CPU cooler, and then exhausted by the fan on the back. You cannot install the graphics card vertically. Mounting holes on the back of the mother board: support dual 2.5 inch hard drive. Cables: Power-supply base: Front hard drive base: you can install two 3.5 inch hard drive","categories":[{"name":"PC building","slug":"PC-building","permalink":"https://helloworldztr.github.io/categories/PC-building/"}],"tags":[{"name":"PC building","slug":"PC-building","permalink":"https://helloworldztr.github.io/tags/PC-building/"},{"name":"AMD","slug":"AMD","permalink":"https://helloworldztr.github.io/tags/AMD/"},{"name":"translation","slug":"translation","permalink":"https://helloworldztr.github.io/tags/translation/"}]},{"title":"Test Title","slug":"test","date":"2020-04-07T00:49:00.000Z","updated":"2020-04-07T03:17:00.790Z","comments":true,"path":"2020/04/07/test/","link":"","permalink":"https://helloworldztr.github.io/2020/04/07/test/","excerpt":"","text":"Test","categories":[{"name":"Test","slug":"Test","permalink":"https://helloworldztr.github.io/categories/Test/"}],"tags":[{"name":"Website Deploy","slug":"Website-Deploy","permalink":"https://helloworldztr.github.io/tags/Website-Deploy/"}]},{"title":"Hello World","slug":"hello-world","date":"2020-04-07T00:22:19.944Z","updated":"2020-04-07T03:16:36.055Z","comments":true,"path":"2020/04/07/hello-world/","link":"","permalink":"https://helloworldztr.github.io/2020/04/07/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment IntroductionI am currently a student from China. I personally enjoy programming and PC building, etc. However, due to my schoolwork, I probably have little time to write this blog and have to translate some articles in Chinese. If I posted a blog that is translated from Chinese, I will paste a link at the top of the article. Something about this websiteAs I cannot get a license for the website ( I am a student QAQ ), this blog is hosted on Github now using GitPage. The blog theme is written by cofess, which you can see on the bottom left of the page. Great thanks to cofess. XD","categories":[],"tags":[]}],"categories":[{"name":"PC building","slug":"PC-building","permalink":"https://helloworldztr.github.io/categories/PC-building/"},{"name":"Test","slug":"Test","permalink":"https://helloworldztr.github.io/categories/Test/"}],"tags":[{"name":"PC building","slug":"PC-building","permalink":"https://helloworldztr.github.io/tags/PC-building/"},{"name":"AMD","slug":"AMD","permalink":"https://helloworldztr.github.io/tags/AMD/"},{"name":"translation","slug":"translation","permalink":"https://helloworldztr.github.io/tags/translation/"},{"name":"Website Deploy","slug":"Website-Deploy","permalink":"https://helloworldztr.github.io/tags/Website-Deploy/"}]}